tap "heroku/brew"
tap "mongodb/brew"
tap "peterldowns/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@7.0"
# Localias is a tool for developers to securely manage local aliases for development servers.
brew "peterldowns/tap/localias"
# Redis desktop manager
cask "another-redis-desktop-manager"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Open-source keystroke visualiser
cask "keycastr"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"